In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
# add decade column
cast['decade'] = (cast['year'] // 10) * 10
cast.head(3)

                 title  year      name   type        character     n  decade
0       Closet Monster  2015  Buffy #1  actor          Buffy 4   NaN    2010
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0    1980
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0    2010

In [3]:
release_dates = pd.read_csv('data/release_dates.csv', index_col=None,
                                      parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

In [20]:
# create a new data frame that contains the information easier to retrieve
release_dates['year']= release_dates['date'].dt.year
release_dates['month']= release_dates['date'].dt.month
release_dates['day']= release_dates['date'].dt.day
release_dates['day_week'] = release_dates['date'].dt.day_name()
release_dates

,title,year,country,date,month,day,day_week
0,"#73, Shaanthi Nivaasa",2007,India,2007-06-15,6,15,Friday
1,#Beings,2015,Romania,2015-01-29,1,29,Thursday
2,#Declimax,2018,Netherlands,2018-01-21,1,21,Sunday
3,#Ewankosau saranghaeyo,2015,Philippines,2015-01-21,1,21,Wednesday
4,#Horror,2015,USA,2015-11-20,11,20,Friday
...,...,...,...,...,...,...,...
452651,xXx: State of the Union,2005,USA,2005-04-29,4,29,Friday
452652,xXx: State of the Union,2005,Poland,2005-06-03,6,3,Friday
452653,xXx: State of the Union,2005,Turkey,2005-06-03,6,3,Friday
452654,xXx: State of the Union,2005,China,2005-06-17,6,17,Friday
452655,xXx: State of the Union,2005,Greece,2005-06-24,6,24,Friday

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [17]:
filter = (release_dates[(release_dates['title'].str.contains('Christmas')) & 
        (release_dates['country'] == 'USA')].groupby('month')['month']
        .count().reset_index(name = 'count'))
filter
# march not included no movies release with christmas in name

    month  count
0       1      2
1       2      2
2       4      1
3       5      1
4       6      1
5       7      1
6       8      2
7       9      2
8      10     14
9      11     38
10     12     47

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

In [18]:
filter = (release_dates[(release_dates['title'].str.contains('Christmas')) & 
        (release_dates['country'] == 'Canada')].groupby('month')['month']
        .count().reset_index(name = 'count'))
filter

   month  count
0     10      2
1     11      9
2     12      6

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

In [19]:
filter = (release_dates[(release_dates['title'].str.startswith('The Hobbit')) & 
        (release_dates['country'] == 'USA')].groupby('month')['month']
        .count().reset_index(name = 'count'))
filter

   month  count
0     12      3

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

In [21]:
filter = (release_dates[(release_dates['title'].str.contains('Romance')) & 
        (release_dates['country'] == 'USA')].groupby('day_week')['day_week']
        .count().reset_index(name = 'count'))
filter

    day_week  count
0     Friday     18
1     Monday     21
2   Saturday      8
3     Sunday     32
4   Thursday      6
5    Tuesday      4
6  Wednesday     11

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

In [22]:
filter = (release_dates[(release_dates['title'].str.contains('Action')) & 
        (release_dates['country'] == 'USA')].groupby('day_week')['day_week']
        .count().reset_index(name = 'count'))
filter

    day_week  count
0     Friday     19
1     Monday      2
2   Saturday      2
3     Sunday      3
4   Thursday      1
5    Tuesday      1
6  Wednesday      3

In [25]:
release_dates.head(3)

                   title  year      country       date  month  day  day_week
0  #73, Shaanthi Nivaasa  2007        India 2007-06-15      6   15    Friday
1                #Beings  2015      Romania 2015-01-29      1   29  Thursday
2              #Declimax  2018  Netherlands 2018-01-21      1   21    Sunday

In [26]:
cast.head(3)

                 title  year      name   type        character     n  decade
0       Closet Monster  2015  Buffy #1  actor          Buffy 4   NaN    2010
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0    1980
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0    2010

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [41]:
# first get the titles of Judi Dench movies from the 1990s
movies = (cast[(cast['decade'] == 1990) & (cast['name'] == 'Judi Dench')])
movies

filter = (release_dates[(release_dates['title'].isin(movies['title']) ) & 
        (release_dates['country'] == 'USA') &
        release_dates['year'].isin(movies['year'])])
filter

,title,year,country,date,month,day,day_week
132332,GoldenEye,1995,USA,1995-11-17,11,17,Friday
138986,Hamlet,1996,USA,1996-12-25,12,25,Wednesday
169109,Jack & Sarah,1996,USA,1996-03-22,3,22,Friday
239011,Mrs Brown,1997,USA,1997-10-03,10,3,Friday
306506,Shakespeare in Love,1999,USA,1999-01-08,1,8,Friday
336559,Tea with Mussolini,1999,USA,1999-05-14,5,14,Friday
406606,The World Is Not Enough,1999,USA,1999-11-19,11,19,Friday
413573,Tomorrow Never Dies,1997,USA,1997-12-19,12,19,Friday

In [44]:
# check the shape of each list to make sure they match

print(movies.shape[0] == filter.shape[0])

True

### In which months do films with the actress Judi Dench tend to be released in the USA?

In [52]:
movies = (cast[(cast['name'] == 'Judi Dench')])
movies

filter = (release_dates[(release_dates['title'].isin(movies['title']) ) & 
        (release_dates['country'] == 'USA') &
        release_dates['year'].isin(movies['year'])].groupby('month')['month'].count().reset_index(name = 'count'))
filter.nlargest(3, 'count')

   month  count
9     11     13
5      6      6
4      5      5

### In which months do films with the actor Tom Cruise tend to be released in the USA?

In [53]:
movies = (cast[(cast['name'] == 'Tom Cruise')])
movies

filter = (release_dates[(release_dates['title'].isin(movies['title']) ) & 
        (release_dates['country'] == 'USA') &
        release_dates['year'].isin(movies['year'])].groupby('month')['month'].count().reset_index(name = 'count'))
filter.nlargest(3, 'count')

    month  count
11     12     10
5       6      8
4       5      6